#+STARTUP: INDENT LOGDONE OVERVIEW NOLOGREFILE LATEXPREVIEW INLINEIMAGES
#+AUTHOR: kirakuiin
#+EMAIL: wang.zhuowei@foxmail.com
#+LANGUAGE: zh-Cn
#+TAGS: { Live : date(d) event(e) shopping(s) }
#+TAGS: { State : future(f) }
#+TODO: TODO(t) SCH(s) WAIT(w@) | DONE(d!) CANCELED(c@)
#+COLUMNS: %25ITEM %TODO %17Effort(Estimated Effort){:} %CLOCKSUM
#+PROPERTY: EffORT_ALL 0 0:15 0:30 1:00 2:00 4:00 8:00
#+OPTIONS: tex:t


* Inbox
* Next Action
** TODO [#A] 大壮名城G1-1018租房月志                                :event:
DEADLINE: <2021-07-12 周一 23:00 +1m> SCHEDULED: <2021-07-12 周一 09:00 +1m>
:PROPERTIES:
:LOGGING: DONE(@)
:END:
- State "DONE"       from "TODO"       [2021-06-13 周日 17:42] \\
  1. 房租2000, 电费100(开了空调), 物业+水117, 办理了电信300m宽带
- State "DONE"       from "TODO"       [2021-05-12 周三 09:21] \\
  1. 房租2000, 本月电费200(实际每月40左右), 物业+水103
- State "DONE"       from "TODO"       [2021-04-10 周六 13:45] \\
  1. 每个月通过大壮名城物业缴纳电费, 水+物业费. 今天水+物业费有103元的残余, 和房东约定这个月我来缴, 明年的4月份房东来缴纳.
  2. 房间里的马桶坏了, 电磁炉可能坏了, 阳台灯坏了
  3. 本月电费50, 物业+水103
  4. 1+2(一个月房租+两个月押金) 6000
** TODO [#A] 归档并回顾一周的计划                                   :event:
DEADLINE: <2021-06-20 周日 23:00 ++1w> SCHEDULED: <2021-06-19 周六 18:00 ++1w>
:PROPERTIES:
:STYLE:    habit
:LOGGING: logrepeat DONE(@)
:LAST_REPEAT: [2021-06-11 周五 17:11]
:END:
- State "DONE"       from "TODO"       [2021-06-11 周五 17:11] \\
  1. 完成了多益第二季度的季度报告
  2. 完成了多益的转正自评(网页版)
  3. 完成了单人多队的工单
     1. 重构了战斗布局界面, 将若干个子界面设置为可以动态替换的类型, 方便扩展
     2. 英雄选框直接抽出来做了一个基类, 多队战斗继承后重载一个接口完成了多队共享英雄选择状态的需求
     3. 战斗结束和暂停页面多队都实现了子类, 通过战斗布局界面的设置子界面接口完成功能跳转
     4. 战斗状态传递通过逻辑层提供的接口完成
     5. 一场战斗结束后逻辑层会发送在场单位的状态, 通过这个状态设置下一场胜利方单位的在场状态
  ------------------------------------------------
  1. 安装了电信300m宽带, 处理了宽带光衰的问题
  ------------------------------------------------
  1. 这周学习任务完成的还行, 只缺了一天
  2. 感觉自己apex又变菜了, 蚌埠住了
- State "DONE"       from "TODO"       [2021-06-06 Sun 23:55] \\
  1. 本周在实现单人多队战斗，截止到今天完成60%
     1. 主要工作点:
        1. 多队战斗的设计和建模(单人和组队)
        2. 如何在尽可能在不破坏原有代码结构的情况下增加多队战斗功能
           1. 界面上选择在当前界面上覆盖一层多队战斗界面而不是直接修改战斗界面
           2. 重构了模型层设置关卡的逻辑, 尽可能将各个玩法抽离, 目前还有部分耦合, 不过已经可以在不修改
              其他函数的情况下增加多队的功能
           3. 界面层和模型层一样做了类似的重构
        3. 小队拖动功能的合理实现
     2. 主要待实现点:
        1. 布局界面英雄选框在各个小队之间共享状态
        2. 战斗布局时上场英雄和战斗进行时显示数据不匹配
        3. 不同回合间英雄生命值状态的传递
        4. 战斗结束或中断时的处理
  ------------------------------------------------
  1. 办理了电信300m宽带, 129每月, 还未安装
  2. 每天开空调睡觉, 电费上涨100%
  ------------------------------------------------
  1. 工作的时候就工作, 玩的时候就玩, 不要边工作边玩, 弄的两边都不尽兴
- State "DONE"       from "TODO"       [2021-05-29 周六 16:22] \\
  1. 支持服务器外测服和真机连接外测服
  2. 处理ios真机包首登无网络配置弹窗问题
  3. 为ios和android真机包添加图标
  4. 为英雄详情界面的几个按钮增加描述性弹框
  5. 完成了临时组队功能
  6. 处理了buff图标没有正确更新,移除的bug
  7. 简单学习了ui编辑器的动画功能
  ------------------------------------------------
  ------------------------------------------------
  1. 这周制作需求比较忙, 读书任务有几天没进行, 以后还是要抽时间来读
- State "DONE"       from "TODO"       [2021-05-23 周日 22:02] \\
  1. 完成了大量m8界面优化相关的工单
  2. 将英雄山部分接入网络协议
  3. 实现了显示服务器时间的功能
  ------------------------------------------------
  1. 接种了第二针新冠疫苗
  2. 购买了工学椅, 升降桌还有一些其他杂物, 家具置办齐全
  ------------------------------------------------
  1. 这周接种疫苗之后当晚就去吃了海鲜烧烤, 导致腹泻发烧, 要注意
- State "DONE"       from "TODO"       [2021-05-16 周日 23:32] \\
  1. 完成了客户端本地文件读取容错处理
  2. 完成了ios和android平台真机包的制作
  ------------------------------------------------
  ------------------------------------------------
  1. 这周没完成读书的任务, 下周注意
- State "DONE"       from "TODO"       [2021-05-09 周日 10:11] \\
  1. 完成了英雄山模块
  2. 完成了英雄山模块的GM功能
  3. 结局了导表生成器会将所有纯数字字符串改为数字的bug(动态替换json.Encoder解析模块)
  4. 完成了org-mode的学习
  ------------------------------------------------
  1. 公司给内网机配备了青轴机械键盘, 不用买了
  2. 把老家的书籍和switch配件
  ------------------------------------------------
- State "DONE"       from "TODO"       [2021-05-02 Sun 23:07] \\
  1. 简单学习了PMGO系统的用法
  2. 完成了神武手游客户端教程的问题总结
  3. 系统的学习了m8项目的逻辑层代码和部分战斗代码
  4. 学习了导表工具的基本用法并完成了英雄山导表的制作
  5. 完成了英雄山界面和模型的设计与实现
  ------------------------------------------------
  1. 让妈妈把游戏配件和书籍邮寄过来
  ------------------------------------------------
- State "DONE"       from "TODO"       [2021-04-25 周日 20:54] \\
  1. 学习了客户端常用功能(Functor, io等)
  2. 学习了调试工具的使用方法
  3. 完成了大作业(结合了全面学到的很多知识, ui控件, mvsn, 观察者等等)
  4. 完成了对Cocos2d摄像机渲染顺序的深入学习
  5. 完成了在线更新的学习
  ------------------------------------------------
  1. 接种了第一针新冠疫苗
  2. 和部门同事聚餐(新疆菜)
  ------------------------------------------------
- State "DONE"       from "TODO"       [2021-04-17 周六 23:21] \\
  1. 学习UI基础, 完成了UI大作业
  2. 学习UI制作经验分享
  3. 学习代码设计, 学会了plantuml类图和时序图的语法, 完成了mvsn作业
  4. 学习了基本资源类型(Sprite3d, Particle3d, 等等)
  5. 学习了文本链接和导表的用法, 完成了导表作业
  ------------------------------------------------
  1. 打扫了新的公寓, 弄得比较干净了
  ------------------------------------------------
- State "DONE"       from "TODO"       [2021-04-11 周日 19:36] \\
  1. org-mode大概学了50%左右, 确实是一个重量级的GTD工具
  2. 完成了利为引擎的所有小作业
  3. 完成了一部分UI编程的作业
  ------------------------------------------------
  1. 顺利搬家到大壮名城, 离公司很近
  2. 家具基本置办齐全, 电脑相关的东西以后再考虑
  ------------------------------------------------
- State "DONE"       from "TODO"       [2021-04-04 周日 19:35] \\
  1. 对使用org-mode进行gtd进行了较为充分的学习, 基本掌握了用法.
  2. 重新读了一遍《python核心编程》, 加深了对py一些基本概念的理解.
  3. 完成了python的入职考试, python150题.
  4. 初步学习了一下利为引擎, 当然除了开始的几章还有例子可以参考, 后面写的太简略了.
  ------------------------------------------------
  1. 自行车从家里邮过来之后组好, 送到车店保养.
  ------------------------------------------------
** TODO [#A] 每月归档到年度文件                                      :event:
DEADLINE: <2021-06-30 Wed 23:00 ++1m> SCHEDULED: <2021-06-30 Wed 09:00 ++1m>
:PROPERTIES:
:STYLE:    habit
:LOGGING: logrepeat DONE(@)
:LAST_REPEAT: [2021-05-30 Sun 09:26]
:END:
- State "DONE"       from "TODO"       [2021-05-30 Sun 09:26] \\
  入职之后的第二个月, 正式开始进入工作, 工作上主要完成:
  1. 完成了m8英雄山基本功能的设计与实现(mvc)
  2. 完成了m8临时组队功能的设置与实现(mvc)
  3. 完成了大量m8界面优化相关的工单
  4. 完成了ios和android平台真机包的制作
  生活上：
  1. 接种了两针新冠疫苗
  2. 家里的东西, 办公用品基本置办齐全
- State "DONE"       from "TODO"       [2021-04-30 周五 23:01] \\
  入职之后的第一个月, 生活和工作逐渐回到了正轨, 主要完成了以下几个主要事情:
  1. 学会了使用org-mode进行gtd管理
  2. 完成了多益的入职培训
  3. 找到了一处还不错的房子
  4. 认识了很多很棒的同事
* Appointment
** TODO 组装一台性价比高的台式机用于开发和娱乐                    :shopping:
<2021-06-01 周二>--<2021-06-30 周三>
- State "WAIT"       from "TODO"       [2021-04-10 周六 14:03] \\
  1. 显卡太贵
  2. 没钱
#+CAPTION[零件表]:
#+NAME: PC_PRICES
| component   | brand    | model                | price | lowest | diff | date |
|-------------+----------+----------------------+-------+--------+------+------|
| motherboard | ASUS     | B550M-ZAKU           |   749 |    949 | -200 |      |
| cpu         | AMD      | Ryzen7-5800X         |  2950 |   2999 |  -49 |      |
| memory      | G.SKILL  | TridentZ-neo(16GB*2) |  1899 |   1349 |  550 |      |
| ssd(sys)    | SAMSUNG  | 980-Pro(256GB)       |   499 |    449 |   50 | 6.16 |
| ssd(app)    | SAMSUNG  | 980(1TB)             |   993 |    939 |   54 | 6.16 |
| gpu         | None     |                      |       |        |    0 |      |
| power       | SEASONIC | FOCUS-GX1000         |  1299 |    899 |  400 |      |
| case        | PHANTEKS | P500A                |   597 |    399 |  198 | 6.15 |
| Fan         | PHANTEKS | Halos(14*1, 12*3)    |   360 |    280 |   80 | 6.16 |
| watercool   | NZXT     | Kraken-Z73           |  1693 |   1679 |   14 | 6.15 |
| Monitor     | MSI      | MAG274QRF-QD         |  1991 |   1879 |  112 | 6.16 |
| keyboard    | DURGOD   | K320w(silver)        |   616 |    629 |  -13 | 6.16 |
| earphone    | KINGSTON | HyperX-Cloud-Flight  |   596 |    559 |   37 | 6.16 |
| mouse       | LOGITECH | PRO-WIRELESS         |   596 |    599 |   -3 | 6.16 |
|             |          |                      | 14838 |  13608 | 1923 |      |
#+Tblfm: $6=$4-$5::@16$4=vsum(+@I..@-1)::@16$5=vsum(+@I..@-1)
可能还需要线缆收纳, 硅脂, 防静电手环等设备
** TODO 手机号码切换                                                :event:
SCHEDULED: <2021-06-12 周六 09:00>
- [ ] 切换手机号绑定(18516114761\rightarrow19128277021 [0%]
  - [ ] 微信
  - [ ] 支付宝
  - [ ] 京东
  - [ ] 天猫
  - [ ] 淘宝
  - [ ] 招商银行(营业厅办理)
  - [ ] 火星
  - [ ] Apple
  - [ ] QQ
  - [ ] Steam
- [ ] 联通手机号停机
** WAIT 爬火炉山                                                     :event:
- State "WAIT"       from "TODO"       [2021-04-11 周日 16:29] \\
  和同事商量一下一起去, 先不急.
** Archive                                                        :ARCHIVE:
*** DONE 处理宽带光衰问题                                            :date:
CLOSED: [2021-06-11 周五 20:10]
:PROPERTIES:
:ARCHIVE_TIME: 2021-06-13 周日 17:37
:END:
- State "DONE"       from "TODO"       [2021-06-11 周五 17:10]
<2021-06-12 Sat 09:00>--<2021-06-13 Sun 21:00>
*** DONE 办理电信宽带业务                                           :event:
CLOSED: [2021-06-07 Mon 20:17] SCHEDULED: <2021-04-10 周六 13:20>
:PROPERTIES:
:ARCHIVE_TIME: 2021-06-13 周日 17:37
:END:
- State "DONE"       from "TODO"       [2021-06-07 Mon 20:17] \\
  129每月, 下行300上行，下行40
- State "WAIT"       from "TODO"       [2021-04-10 周六 13:36] \\
  暂时没需求.
* Project
* Someday
